In [228]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.metrics import confusion_matrix
import sklearn.metrics as sm
%matplotlib inline

In [229]:
dataset_plans= pd.read_csv('dataset_plans003.csv')

In [230]:
dataset_plans

,Inputs,Bed rooms,Bath rooms,Living rooms,Kitchen,Images,Label
0,A,1,1,1,1,"P1,P2,P3,P4,P5,P6,P7,P8,P9,P10,P11",0
1,B,1,2,1,1,"P12,P13",1
2,C,2,1,1,1,"B1,B4,B5,B9",2
3,D,2,2,1,1,"B2,B3,B6,B7",3
4,E,3,1,1,1,"R3,R6,R10",4
5,F,3,2,1,1,"R1,R2,R4,R5,R7,R8,R9",5

In [231]:
dataset_plans.describe()

       Bed rooms  Bath rooms  Living rooms  Kitchen     Label
count   6.000000    6.000000           6.0      6.0  6.000000
mean    2.000000    1.500000           1.0      1.0  2.500000
std     0.894427    0.547723           0.0      0.0  1.870829
min     1.000000    1.000000           1.0      1.0  0.000000
25%     1.250000    1.000000           1.0      1.0  1.250000
50%     2.000000    1.500000           1.0      1.0  2.500000
75%     2.750000    2.000000           1.0      1.0  3.750000
max     3.000000    2.000000           1.0      1.0  5.000000

In [232]:
dataset_plans.shape

(6, 7)

In [233]:
sum(dataset_plans.isnull().sum())

0

In [234]:
print((dataset_plans[['Bed rooms','Bath rooms','Inputs','Label']]==0).sum())

Bed rooms     0
Bath rooms    0
Inputs        0
Label         1
dtype: int64

In [235]:
X = dataset_plans[['Bed rooms','Bath rooms']]
X

   Bed rooms  Bath rooms
0          1           1
1          1           2
2          2           1
3          2           2
4          3           1
5          3           2

In [236]:
Y = dataset_plans['Label']
Y

0    0
1    1
2    2
3    3
4    4
5    5
Name: Label, dtype: int64

In [237]:
# plt.scatter(X,Y)

In [238]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(X,Y,random_state = 0)

In [239]:
x_train

   Bed rooms  Bath rooms
1          1           2
3          2           2
0          1           1
4          3           1

In [240]:
x_test

   Bed rooms  Bath rooms
5          3           2
2          2           1

In [241]:
y_train

1    1
3    3
0    0
4    4
Name: Label, dtype: int64

In [242]:
y_test

5    5
2    2
Name: Label, dtype: int64